/*********************************************************************************************************
* 模块名称: 
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年01月01日 
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/

#include"PWM.h"
#include "stm32f10x_conf.h" 

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 static  i16 s_iDutyCycle = 0;  //用于存放占空比 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigTimer3ForPWMPB5(u16 arr, u16 psc);// 配置 PWM 
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: ConfigTimer3ForPWMPB5 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
static void ConfigTimer3ForPWMPB5(u16 arr, u16 psc) 
{
  GPIO_InitTypeDef GPIO_InitStructure;            //定义结构体 GPIO_InitStructure,用来配置 TIM3 的 GPIO 
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure; //定义结构体 TIM_TimeBaseStructure,用来配置 TIM3 的基本参数 
  TIM_OCInitTypeDef  TIM_OCInitStructure;         //定义结构体 TIM_OCInitStructure,用来配置 TIM3 的通道参数 
  
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);    //使能 TIM3 的时钟 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);   //使能 TIM3.CH2 的引脚时钟 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);    //使能 AFIO 复用功能模块时钟 
  
  //注意：GPIO_PinRemapConfig 必须放在 RCC_APBxPeriphClockCmd 的后面才可以 
  GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE);    //TIM3 部分重映射 TIM3.CH2->PB5
  
  //设置该引脚为复用推挽输出模式,输出 TIM3.CH2 的 PWM 脉冲波形 
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;             //设置 TIM3.CH2 的引脚 
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;        //复用推挽输出模式 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;       //设置 I/O 口速率为 50MHz 
  GPIO_Init(GPIOB, &GPIO_InitStructure);                  //根据参数初始化 TIM3 的 GPIO 端口
  
  TIM_TimeBaseStructure.TIM_Period        = arr;          //设置自动重装载周期值 
  TIM_TimeBaseStructure.TIM_Prescaler     = psc;          //设置预分频值为不分频 
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;            //设置时钟分割:TDTS = Tck_tim 
  TIM_TimeBaseStructure.TIM_CounterMode   = TIM_CounterMode_Up;  //设置计数模式为向上计数模式 
  TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);         //根据指定的参数初始化 TIM3 的基本参数 
  
  //PWM2 模式，TIM_CounterMode_Up 模式下，TIMx_CNT < TIMx_CCRx 时为无效电平（高电平）   
  TIM_OCInitStructure.TIM_OCMode      = TIM_OCMode_PWM2;        //选择 PWM2 模式 
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //比较输出使能 
  TIM_OCInitStructure.TIM_OCPolarity  = TIM_OCPolarity_Low;     //设置极性，OC2 低电平有效  
  TIM_OC2Init(TIM3, &TIM_OCInitStructure);                      //根据参数初始化 TIM3 的通道 
  
  TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);             //TIM.CH2 通道预装载使能 
  
  TIM_Cmd(TIM3, ENABLE);                                        //使能 TIM3
  
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitPWM 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
void  InitPWM(void) 
{
  ConfigTimer3ForPWMPB5(599, 999);  //TIM3 PWM初始化, 72000000/(999+1)/(599+1) = 120Hz 
  TIM_SetCompare2(TIM3, 0);         //初始值为0 
}
/*********************************************************************************************************
* 函数名称: SetPWM 
* 函数功能: 设置占空比
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
void SetPWM(i16 val) 
{
  s_iDutyCycle = val;                   //获取占空比的值
  
  TIM_SetCompare2(TIM3, s_iDutyCycle);  //设置占空比 
}
/*********************************************************************************************************
* 函数名称: IncPWMDutyCycle 
* 函数功能: 递增占空比，每次递增10，一直增到高电平输出为止
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
void IncPWMDutyCycle(void) 
{
  if(s_iDutyCycle >= 600)               //如果占空比不小于600 
  {
    s_iDutyCycle = 600;                 //保持占空比值为600 
  }
  else
  {
    s_iDutyCycle += 50;                 //占空比加50 
  }
  
  TIM_SetCompare2(TIM3, s_iDutyCycle);  //设置占空比 
}
/*********************************************************************************************************
* 函数名称: DecPWMDutyCycle 
* 函数功能: 递减占空比，每次递减10，一直减到低电平输出为止
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
void DecPWMDutyCycle(void) 
{
  if(s_iDutyCycle <= 0)               //如果占空比不大于0 
  {
    s_iDutyCycle = 0;                 //保持占空比值为0 
  }
  else
  {
    s_iDutyCycle -= 50;               //占空比减50 
  }
  
  TIM_SetCompare2(TIM3, s_iDutyCycle);//设置占空比
}